## I. Giả sử bạn cần tổng hợp dữ liệu nhân sự của nhiều phòng ban trong công ty để có một dữ liệu tổng thể nhân sự
File excel: employee.xlsx
- sheet 1: Phòng IT
- sheet 2: Phòng Kế toán
- Sheet 3: Phòng Marketing

#### I.1 Dùng pandas để đọc dữ liệu từ 3 sheet trên từ file excel employee.xlsx

#### I.2 Gộp các dataframe thành 1 dataframe duy nhất

#### I.3 Thêm 1 cột 'department' để định nghĩa phòng ban cho nhân sự (giá trị của cột department tương ứng: Technology, Accountant, Marketing)

#### I.4 Ghi dữ liệu ra file CSV, đầu ra bao gồm cả cột index, các cột và giá trị cách nhau bởi ký tự |

----

### II. Xử lý việc missing data

Khởi tạo dataframe theo code bên dưới

In [50]:
import pandas as pd
import numpy as np
pd.set_option('display.max_rows', None)
#pd.set_option('display.max_columns', None)
df = pd.DataFrame({
'ord_no':[70001,np.nan,70002,70004,np.nan,70005,np.nan,70010,70003,70012,np.nan,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10',np.nan,'2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3002,3001,3001,3003,3002,3001,3001,3004,3003,3002,3001,3001],
'salesman_id':[5002,5003,5001,np.nan,5002,5001,5001,np.nan,5003,5002,5003,np.nan]})

#### II.1 Viết chương trình xác định từng cột có bị missing value hay không

#### II.2 Viết chương trình xác định số lượng missing value mỗi cột

#### II.3 Viết chương trình loại bỏ tất cả các dòng mà giá trị tất cả của dòng đó null

#### II.4 Viết chương trình thay tất cả giá trị Nan của cột ord_no bằng giá trị 0

---

### III. Xử lý dữ liệu lấy từ API

* url API: https://mocki.io/v1/840088ea-222f-4fe3-bb17-fa093e7be836

Trong trường hợp link trên lỗi thì sử dụng url: https://dummyjson.com/c/bf8e-11d4-404d-aace để thay thế

#### III.1 Extract data từ trường employees trong kết quả từ API trả về load vào dataframe pandas
bảng data bao gồm 2 cột: name và city

#### III.2 Lưu kết quả data dưới dạng file pickle

In [35]:
import pandas as pd
employee_data = pd.read_excel('/Users/manuelmacbookpro/Downloads/homework4python/employee.xlsx')
all_sheets = pd.read_excel('/Users/manuelmacbookpro/Downloads/homework4python/employee.xlsx', sheet_name=None)

for sheet_name, df in all_sheets.items():
    print(f"Sheet name: {sheet_name}")
    print(df.head(21))  # Display the first 21 rows of each DataFrame
    print("\n")

Sheet name: Sheet1
    emp_id   first_name   last_name  hire_date
0      100       Steven        King 2003-06-17
1      101        Neena     Kochhar 2005-09-21
2      102          Lex     De Haan 2001-01-13
3      103    Alexander      Hunold 2006-01-03
4      104        Bruce       Ernst 2007-05-21
5      105        David      Austin 2005-06-25
6      106        Valli   Pataballa 2006-02-05
7      107        Diana     Lorentz 2007-02-07
8      108        Nancy   Greenberg 2002-08-17
9      109       Daniel      Faviet 2002-08-16
10     110         John        Chen 2005-09-28
11     111       Ismael     Sciarra 2005-09-30
12     112  Jose Manuel       Urman 2006-03-07
13     113         Luis        Popp 2007-12-07
14     114          Den    Raphaely 2002-12-07
15     115    Alexander        Khoo 2003-05-18
16     116       Shelli       Baida 2005-12-24
17     117        Sigal      Tobias 2005-07-24
18     118          Guy      Himuro 2006-11-15
19     119        Karen  Colmenares 2007-08-10


Sheet name: Sheet2
    emp_id first_name    last_name  hire_date
0      120    Matthew        Weiss 2004-07-18
1      121       Adam        Fripp 2005-04-10
2      122      Payam     Kaufling 2003-05-01
3      123     Shanta      Vollman 2005-10-10
4      124      Kevin      Mourgos 2007-11-16
5      125      Julia        Nayer 2005-07-16
6      126      Irene  Mikkilineni 2006-09-28
7      127      James       Landry 2007-01-14
8      128     Steven       Markle 2008-03-08
9      129      Laura       Bissot 2005-08-20
10     130      Mozhe     Atkinson 2005-10-30
11     131      James       Marlow 2005-02-16
12     132         TJ        Olson 2007-04-10
13     133      Jason       Mallin 2004-06-14
14     134    Michael       Rogers 2006-08-26
15     135         Ki          Gee 2007-12-12
16     136      Hazel   Philtanker 2008-02-06
17     137     Renske       Ladwig 2003-07-14
18     138    Stephen       Stiles 2005-10-26


Sheet name: Sheet3
   emp_id first_name  last_name  hire_date
0     141     Trenna       Rajs 2003-10-17
1     142     Curtis     Davies 2005-01-29
2     143    Randall      Matos 2006-03-15
3     144      Peter     Vargas 2006-07-09
4     145       John    Russell 2004-10-01
5     146      Karen   Partners 2005-01-05
6     147    Alberto  Errazuriz 2005-03-10
7     148     Gerald  Cambrault 2007-10-15
8     149      Eleni    Zlotkey 2008-01-29

In [155]:

sheet1_df = all_sheets['Sheet1']
sheet2_df = all_sheets['Sheet2']  
sheet3_df = all_sheets['Sheet3']

In [45]:
combined_data = pd.concat(all_sheets.values(), ignore_index=True)

print(combined_data.head(100))

    emp_id   first_name    last_name  hire_date
0      100       Steven         King 2003-06-17
1      101        Neena      Kochhar 2005-09-21
2      102          Lex      De Haan 2001-01-13
3      103    Alexander       Hunold 2006-01-03
4      104        Bruce        Ernst 2007-05-21
5      105        David       Austin 2005-06-25
6      106        Valli    Pataballa 2006-02-05
7      107        Diana      Lorentz 2007-02-07
8      108        Nancy    Greenberg 2002-08-17
9      109       Daniel       Faviet 2002-08-16
10     110         John         Chen 2005-09-28
11     111       Ismael      Sciarra 2005-09-30
12     112  Jose Manuel        Urman 2006-03-07
13     113         Luis         Popp 2007-12-07
14     114          Den     Raphaely 2002-12-07
15     115    Alexander         Khoo 2003-05-18
16     116       Shelli        Baida 2005-12-24
17     117        Sigal       Tobias 2005-07-24
18     118          Guy       Himuro 2006-11-15
19     119        Karen   Colmenares 2007-08-10
20     120      Matthew        Weiss 2004-07-18
21     121         Adam        Fripp 2005-04-10
22     122        Payam     Kaufling 2003-05-01
23     123       Shanta      Vollman 2005-10-10
24     124        Kevin      Mourgos 2007-11-16
25     125        Julia        Nayer 2005-07-16
26     126        Irene  Mikkilineni 2006-09-28
27     127        James       Landry 2007-01-14
28     128       Steven       Markle 2008-03-08
29     129        Laura       Bissot 2005-08-20
30     130        Mozhe     Atkinson 2005-10-30
31     131        James       Marlow 2005-02-16
32     132           TJ        Olson 2007-04-10
33     133        Jason       Mallin 2004-06-14
34     134      Michael       Rogers 2006-08-26
35     135           Ki          Gee 2007-12-12
36     136        Hazel   Philtanker 2008-02-06
37     137       Renske       Ladwig 2003-07-14
38     138      Stephen       Stiles 2005-10-26
39     141       Trenna         Rajs 2003-10-17
40     142       Curtis       Davies 2005-01-29
41     143      Randall        Matos 2006-03-15
42     144        Peter       Vargas 2006-07-09
43     145         John      Russell 2004-10-01
44     146        Karen     Partners 2005-01-05
45     147      Alberto    Errazuriz 2005-03-10
46     148       Gerald    Cambrault 2007-10-15
47     149        Eleni      Zlotkey 2008-01-29

In [11]:
employee_data.shape[1]

4

In [15]:
employee_data.columns

Index(['emp_id', 'first_name', 'last_name', 'hire_date'], dtype='object')

In [157]:

department = ['Technology'] * len(all_sheets['Sheet1']) + \
              ['Accountant'] * len(all_sheets['Sheet2']) + \
             ['Marketing'] * len(all_sheets['Sheet3'])

combined_data['department'] = department_values

print(combined_data.head(100))

    emp_id   first_name    last_name  hire_date  department
0      100       Steven         King 2003-06-17  Technology
1      101        Neena      Kochhar 2005-09-21  Technology
2      102          Lex      De Haan 2001-01-13  Technology
3      103    Alexander       Hunold 2006-01-03  Technology
4      104        Bruce        Ernst 2007-05-21  Technology
5      105        David       Austin 2005-06-25  Technology
6      106        Valli    Pataballa 2006-02-05  Technology
7      107        Diana      Lorentz 2007-02-07  Technology
8      108        Nancy    Greenberg 2002-08-17  Technology
9      109       Daniel       Faviet 2002-08-16  Technology
10     110         John         Chen 2005-09-28  Technology
11     111       Ismael      Sciarra 2005-09-30  Technology
12     112  Jose Manuel        Urman 2006-03-07  Technology
13     113         Luis         Popp 2007-12-07  Technology
14     114          Den     Raphaely 2002-12-07  Technology
15     115    Alexander         Khoo 2003-05-18  Technology
16     116       Shelli        Baida 2005-12-24  Technology
17     117        Sigal       Tobias 2005-07-24  Technology
18     118          Guy       Himuro 2006-11-15  Technology
19     119        Karen   Colmenares 2007-08-10  Technology
20     120      Matthew        Weiss 2004-07-18  Accountant
21     121         Adam        Fripp 2005-04-10  Accountant
22     122        Payam     Kaufling 2003-05-01  Accountant
23     123       Shanta      Vollman 2005-10-10  Accountant
24     124        Kevin      Mourgos 2007-11-16  Accountant
25     125        Julia        Nayer 2005-07-16  Accountant
26     126        Irene  Mikkilineni 2006-09-28  Accountant
27     127        James       Landry 2007-01-14  Accountant
28     128       Steven       Markle 2008-03-08  Accountant
29     129        Laura       Bissot 2005-08-20  Accountant
30     130        Mozhe     Atkinson 2005-10-30  Accountant
31     131        James       Marlow 2005-02-16  Accountant
32     132           TJ        Olson 2007-04-10  Accountant
33     133        Jason       Mallin 2004-06-14  Accountant
34     134      Michael       Rogers 2006-08-26  Accountant
35     135           Ki          Gee 2007-12-12  Accountant
36     136        Hazel   Philtanker 2008-02-06  Accountant
37     137       Renske       Ladwig 2003-07-14  Accountant
38     138      Stephen       Stiles 2005-10-26  Accountant
39     141       Trenna         Rajs 2003-10-17   Marketing
40     142       Curtis       Davies 2005-01-29   Marketing
41     143      Randall        Matos 2006-03-15   Marketing
42     144        Peter       Vargas 2006-07-09   Marketing
43     145         John      Russell 2004-10-01   Marketing
44     146        Karen     Partners 2005-01-05   Marketing
45     147      Alberto    Errazuriz 2005-03-10   Marketing
46     148       Gerald    Cambrault 2007-10-15   Marketing
47     149        Eleni      Zlotkey 2008-01-29   Marketing

In [168]:
import pandas as pd
import numpy as np


pd.set_option('display.max_rows', None)

# Initialize the DataFrame
df = pd.DataFrame({
    'ord_no': [70001, np.nan, 70002, 70004, np.nan, 70005, np.nan, 70010, 70003, 70012, np.nan, 70013],
    'purch_amt': [150.5, 270.65, 65.26, 110.5, 948.5, 2400.6, 5760, 1983.43, 2480.4, 250.45, 75.29, 3045.6],
    'ord_date': ['2012-10-05', '2012-09-10', np.nan, '2012-08-17', '2012-09-10', '2012-07-27', '2012-09-10', '2012-10-10', '2012-10-10', '2012-06-27', '2012-08-17', '2012-04-25'],
    'customer_id': [3002, 3001, 3001, 3003, 3002, 3001, 3001, 3004, 3003, 3002, 3001, 3001],
    'salesman_id': [5002, 5003, 5001, np.nan, 5002, 5001, 5001, np.nan, 5003, 5002, 5003, np.nan]
})

# Display the DataFrame
print(df)

     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
1       NaN     270.65  2012-09-10         3001       5003.0
2   70002.0      65.26         NaN         3001       5001.0
3   70004.0     110.50  2012-08-17         3003          NaN
4       NaN     948.50  2012-09-10         3002       5002.0
5   70005.0    2400.60  2012-07-27         3001       5001.0
6       NaN    5760.00  2012-09-10         3001       5001.0
7   70010.0    1983.43  2012-10-10         3004          NaN
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
10      NaN      75.29  2012-08-17         3001       5003.0
11  70013.0    3045.60  2012-04-25         3001          NaN

In [172]:
Collum_miss = df.isnull().any()

for column, has_missing in Collum_miss.items():
    if has_missing:
        print(f"{column}: Có")
    else:
        print(f"{column}: Không")

ord_no: Có
purch_amt: Không
ord_date: Có
customer_id: Không
salesman_id: Có

In [174]:

missing_count = df.isnull().sum()
print("\nSố lượng missing values mỗi cột:\n", missing_count)

Số lượng missing values mỗi cột:
 ord_no         4
purch_amt      0
ord_date       1
customer_id    0
salesman_id    3
dtype: int64

In [67]:
df_cleaned = df.dropna(how='all')
print("\nDataFrame sau khi loại bỏ các dòng mà tất cả giá trị đều null:\n", df_cleaned)

DataFrame sau khi loại bỏ các dòng mà tất cả giá trị đều null:
      ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
1       NaN     270.65  2012-09-10         3001       5003.0
2   70002.0      65.26         NaN         3001       5001.0
3   70004.0     110.50  2012-08-17         3003          NaN
4       NaN     948.50  2012-09-10         3002       5002.0
5   70005.0    2400.60  2012-07-27         3001       5001.0
6       NaN    5760.00  2012-09-10         3001       5001.0
7   70010.0    1983.43  2012-10-10         3004          NaN
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
10      NaN      75.29  2012-08-17         3001       5003.0
11  70013.0    3045.60  2012-04-25         3001          NaN

In [153]:
remove_null = df.dropna(how='all')
print("DataFrame sau khi loại bỏ các dòng mà tất cả các giá trị đều null:")
print(remove_null)

DataFrame sau khi loại bỏ các dòng mà tất cả các giá trị đều null:
          name         city
0     Quang Vu    Hai Phong
1  Minh Nguyen    Thai Binh
2    Quynh Anh      Unknown
3  Phuong Hang      Ben Tre
4  Phuong Hang      Ben Tre
5     Chinh Vo  Ho Chi Minh

In [75]:
# Replace all NaN values in the 'ord_no' column with 0
df['ord_no'].fillna(0, inplace=True)

# Display the updated DataFrame
print("\nDataFrame sau khi thay thế giá trị NaN của cột 'ord_no' bằng 0:\n", df)

DataFrame sau khi thay thế giá trị NaN của cột 'ord_no' bằng 0:
      ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
1       0.0     270.65  2012-09-10         3001       5003.0
2   70002.0      65.26         NaN         3001       5001.0
3   70004.0     110.50  2012-08-17         3003          NaN
4       0.0     948.50  2012-09-10         3002       5002.0
5   70005.0    2400.60  2012-07-27         3001       5001.0
6       0.0    5760.00  2012-09-10         3001       5001.0
7   70010.0    1983.43  2012-10-10         3004          NaN
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
10      0.0      75.29  2012-08-17         3001       5003.0
11  70013.0    3045.60  2012-04-25         3001          NaN

/var/folders/lg/ym68kvgx79d4ggc751kgymb80000gn/T/ipykernel_48077/3779909188.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['ord_no'].fillna(0, inplace=True)

In [130]:

import requests
url = 'https://mocki.io/v1/840088ea-222f-4fe3-bb17-fa093e7be836'
resp = requests.get(url)
resp
api_url = 'https://mocki.io/v1/840088ea-222f-4fe3-bb17-fa093e7be836'  # Replace with your actual API URL
employee_API = extract_data_from_api(api_url)

if data is not None:
    print("Data extracted successfully:")
    print(employee_API)

Data extracted successfully:
{'status': 'OK', 'code': 200, 'employees': [{'name': 'Quang Vu', 'city': 'Hai Phong'}, {'name': 'Minh Nguyen', 'city': 'Thai Binh'}, {'name': 'Quynh Anh', 'city': None}, {'name': 'Phuong Hang', 'city': 'Ben Tre'}, {'name': 'Phuong Hang', 'city': 'Ben Tre'}, {'name': 'Chinh Vo', 'city': 'Ho Chi Minh'}]}

In [144]:
import pandas as pd
employees = data['employees']

df = pd.DataFrame(employees)

df['city'].fillna('Unknown', inplace=True)
print("Formatted Data Table:")
print(df)

Formatted Data Table:
          name         city
0     Quang Vu    Hai Phong
1  Minh Nguyen    Thai Binh
2    Quynh Anh      Unknown
3  Phuong Hang      Ben Tre
4  Phuong Hang      Ben Tre
5     Chinh Vo  Ho Chi Minh

/var/folders/lg/ym68kvgx79d4ggc751kgymb80000gn/T/ipykernel_48077/4098298896.py:10: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['city'].fillna('Unknown', inplace=True)